package com.just.Lesson10;
/**
 * Создайте пакет р1, внем класс А.
 * В пакете р1 создайте подпакет р2 , в нем класс В со static элементами.
 * В подпакете р2 создайте подпакет р3, в нем класс С. Создайте новый пакет р4, в нем класс D.
 * В пакете р4 создайте подпакет р5 и в нем класс Е. Внутри класса D  напишите код , который будет зайдествовать любые
 * элементы классов A,C,E,  а так же import static com.just.Lesson9.Car.t; элемент класса B.
 * Используя выражения import  и import static , работайте с не полными именами классов.
 */

